#-*- coding: utf-8 -*-
import numpy as np

#1. Створіть масив зі списку, що складається з чисел від 0 до 9, за допомогою
#функції array (Install)) з модуля numpy.

arr1 = np.array([0,1,2,3,4,5,6,7,8,9])
print(arr1)

#2. Створіть масив, що складається з непарних чисел від 1 до 19, за допомогою
#функції arange (Install)) з модуля NumPy.
print('--------------------------')
print(arr1[arr1 %2 == 1])

#3. Створіть масив, що складається з двадцяти нулів.
arr2 = np.zeros([1, 20])
print(arr2)

#4. Створіть двовимірний масив, що складається з двадцяти одиниць, в якому 5
#рядків і 4 стобці.