#-*- coding: utf-8 -*-
import numpy as np

#1. Створіть масив зі списку, що складається з чисел від 0 до 9, за допомогою
#функції array (Install)) з модуля numpy.

arr1 = np.array([0,1,2,3,4,5,6,7,8,9])
print(arr1)
print('--------------------------')

#2. Створіть масив, що складається з непарних чисел від 1 до 19, за допомогою
#функції arange (Install)) з модуля NumPy.
# print('--------------------------')
# print(arr1[arr1 %2 == 1])

arr2 = np.arange(1,20,2)
print(arr2)
print('--------------------------')

#3. Створіть масив, що складається з двадцяти нулів.
arr3 = np.zeros((1, 20 ))
print(arr3)

#4. Створіть двовимірний масив, що складається з двадцяти одиниць, в якому 5
#рядків і 4 стобці.
arr4 = np.ones([4, 5, 1],dtype=np.int)
print(arr4)
print('--------------------------')

#5. Створіть масив, що складається з п'яти рівномірно розподілених чисел від 3 до 7.


#6. Створіть двовимірний масив, що складається з 9 рівномірно розподілених чисел від 3 до 7.



#7. Створіть масив, що складається з 10 випадкових цілих чисел з діапазону від 1 до 100, 
# надайте його максимальне значення змінної max_number і виведіть
#значення цієї змінної за допомогою функції print (Install)).
arr7 = np.random.randint(1,100,10)
print(arr7)
max_number = np.amax(arr7)
print('max_number= ' + str(max_number))